      * X/Open CAE Specification
      * Distributed Transaction Processing:
      * The XATMI Specification
      * ISBN: 1-85912-130-6
      * X/Open Document Number: C506

      *
      *  TPSVCRET.cpy
      *
       05 TP-RETURN-VAL             PIC S9(9) COMP-5.
               88 TPSUCCESS                 VALUE 0.
               88 TPFAIL                    VALUE 1.
       05 APPL-CODE                 PIC S9(9) COMP-5.

